# 1.Напишите программу, которая принимает на вход цифру, обозначающую день недели,# и проверяет, является ли этот день выходным.# Пример:# - 6 -> да# - 7 -> да# - 1 -> нет# n = int(input('Введите день недели: '))# if n > 0 and n < 8:#     if n > 5:#         print('Да, это выходной')#     else:#         print('Нет, это не выходной')# else:#     print('В неделе 7 дней, введите корректное число')# Напишите программу для проверки истинности утверждения# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.# check = True# for x in range(0,2):#     for y in range(0, 2):#         for z in range(0,2):#             if not(x and y and z) != (not x or not y or not z):#                 check = False## if check:#     print('Утверждение верно')# 3.Напишите программу, которая принимает на вход координаты точки (X и Y),# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится# эта точка (или на какой оси она находится).# Пример:# - x=34; y=-30 -> 4# - x=2; y=4-> 1# - x=-34; y=-30 -> 3# x, y = int(input('введите х (отличный от нуля): ')), int(input('введите у (отличный от нуля): '))# if x > 0 and y > 0:#     print(f'x = {x}, y = {y}, I четверть')# if x < 0 and y > 0:#     print(f'x = {x}, y = {y}, II четверть')# if x < 0 and y < 0:#     print(f'x = {x}, y = {y}, III четверть')# if x > 0 and y < 0:#     print(f'x = {x}, y = {y}, IV четверть')# else:#     print('Значения х и у должны быть отличны от нуля')# 4.Напишите программу, которая по заданному номеру четверти# показывает диапазон возможных координат точек в этой четверти (x и y).## n = int(input('Введите номер четверти: '))# if n == 1:#     print('I четверть: значения х больше 0, значения у больше 0')# elif n == 2:#     print('II четверть: значения х меньше 0, значения у больше 0')# elif n == 3:#     print('III четверть: значения х меньше 0, значения у меньше 0')# elif n == 4:#     print('IV четверть: значения х больше 0, значения у меньше 0')# Напишите программу, которая принимает на вход координаты двух точек и# находит расстояние между ними в 2D пространстве.# Пример:# - A (3,6); B (2,1) -> 5,09# - A (7,-5); B (1,-1) -> 7,21# x_1, y_1, x_2, y_2 = int(input('Введите координаты х первой точки: ')), int(input('Введите координаты у первой точки: ')), int(input('Введите координаты х второй точки: ')), int(input('Введите координаты у второй точки: '))# print(f'Введенные координаты: ({x_1},{y_1}); ({x_2},{y_2}). Расстояние между точками в 2D пространстве составляет {(((x_1 - x_2)**2 + (y_1 - y_2)**2)**0.5):.2f}')